# This is a file written in Emacs and authored using org-mode (http://orgmode.org/)
# The "README.md" file is generated from this file by running the
# "M-x org-md-export-to-markdown" command from inside of Emacs.
# 
# The rest of the files are generated from this file by running the
# "M-x org-babel-tangle" command from inside of Emacs.
# 
# The options below control the behavior of org-md-export-to-markdown:
#
# Don't render a Table of Contents 
#+OPTIONS: toc:nil
# Don't render section numbers
#+OPTIONS: num:nil
# Turn of subscript parsing: http://super-user.org/wordpress/2012/02/02/how-to-get-rid-of-subscript-annoyance-in-org-mode/comment-page-1/
#+OPTIONS: ^:{}
** tests/test_flask_app.py
   In order to simulate connecting to a JWKs endpoint, we need a
   certificate to use for use in our unit tests. Below is how to
   generate a private key and certificate using OpenSSL. Note that we
   use =/dev/stdout= to capture the output from the command into =org-babel=.

   #+BEGIN_SRC sh :results html
   openssl req -new -newkey rsa:1024 -days 365 -nodes -x509 -subj "/CN=example.com" -keyout /dev/stdout -out /dev/stdout
   #+END_SRC

   #+RESULTS:
   #+NAME: private_key_and_certificate
   #+BEGIN_HTML
   -----BEGIN RSA PRIVATE KEY-----
   MIICXQIBAAKBgQDYrIBJjY822hL90KbvGz/FfbrUbDfCcScc1IzUn95O1I+AXwBX
   yaSh0HJhXEztBvKkfD9+Kq7Blx8EmRfGo6ziT+fZ0mE0WhZv87nFwvedApsCwTEt
   /r3VNNsRmwGGSXxTlbYj1OB3QdGeyl9Gk127akSRBBet7Y2XCezOu809cQIDAQAB
   AoGBALU3MORTfOAHa7LUe4mnZKKsEUHwcIIzWN8H9fEu9CNCK/LVgdfqUcL0L3W2
   WLA1C2L+d6vxzs8isVKLKBN+eOwUnhbMbMtD8h1SbTUV/JFrZsHycNcff4ythjLW
   dMo91+t7EcMKDVmej384Saj8D0z2i1QItvBK/msmSQqdYMXxAkEA72IanU3e5EI1
   rkII0/eVLliK6IM+uhaCgAz7Pt7bxntO2NZ8rscn93v6X7SS2Q/QQKyfsT+AbCXk
   bMCQE/AsFwJBAOe22JWgT1kIlmPVOaid/XErVV9YYdy7SxkAhvQYzHagWfhQaGpX
   sMrX1D5i4eIO9JHRu5zPupCGXRWT43UWr7cCQAi61Smja1t7pqWCNvwz7TbRd89e
   6eyzYXL2BjuWuQEWAhwaRlXBYY2+8bSHy0srLncNVI2MOUy4XQoyQ47WlWUCQGZM
   vZZhrmZ6ehsdWlVtWyWJoil0FdCkB+XD69D82dhNtysAJPk+Odl0LEpW0a9CNwvh
   8tiqhY2lJJeQMU3SdEUCQQCxJ5bXPM5iVDBzV50l3DfDN71srr9KGdCahCuxQpRt
   3ZRkZkz9izeRgRM5GRbOM7xpMWKLXFF0E7Y7jF3aa6xD
   -----END RSA PRIVATE KEY-----
   -----BEGIN CERTIFICATE-----
   MIICITCCAYqgAwIBAgIJAPvk/teL+BzRMA0GCSqGSIb3DQEBBQUAMBYxFDASBgNV
   BAMTC2V4YW1wbGUuY29tMB4XDTE2MDIyMzAwNTg1M1oXDTE3MDIyMjAwNTg1M1ow
   FjEUMBIGA1UEAxMLZXhhbXBsZS5jb20wgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJ
   AoGBANisgEmNjzbaEv3Qpu8bP8V9utRsN8JxJxzUjNSf3k7Uj4BfAFfJpKHQcmFc
   TO0G8qR8P34qrsGXHwSZF8ajrOJP59nSYTRaFm/zucXC950CmwLBMS3+vdU02xGb
   AYZJfFOVtiPU4HdB0Z7KX0aTXbtqRJEEF63tjZcJ7M67zT1xAgMBAAGjdzB1MB0G
   A1UdDgQWBBSSEwsnoHW75GR+74R+9RJDHlMCJTBGBgNVHSMEPzA9gBSSEwsnoHW7
   5GR+74R+9RJDHlMCJaEapBgwFjEUMBIGA1UEAxMLZXhhbXBsZS5jb22CCQD75P7X
   i/gc0TAMBgNVHRMEBTADAQH/MA0GCSqGSIb3DQEBBQUAA4GBACJdQamPTI/qf6fo
   ovWrffMKnreULYrYAaL4drzQezUpoZ626/Ur3CwpIKqWDsYSvjwKPl0DUyLEuw5J
   2QD4X5n/K7/YGGQJSK8fxazsHavyxQhen1uz7X7zWFflIM6+5DvnOtoq3F0yQ84h
   L6U2LeRpzO4rWw3kxr/jsGkxYaUR
   -----END CERTIFICATE-----
   #+END_HTML

   Here is how we extract private key part of the OpenSSL command:
   #+BEGIN_SRC sh :var pk_and_cert=private_key_and_certificate :results code
   echo "$pk_and_cert" | sed -e 's/^[ ]*//' | head -15
   #+END_SRC

   #+RESULTS:
   #+NAME: private_key_for_testing
   #+BEGIN_SRC sh
   -----BEGIN RSA PRIVATE KEY-----
   MIICXQIBAAKBgQDYrIBJjY822hL90KbvGz/FfbrUbDfCcScc1IzUn95O1I+AXwBX
   yaSh0HJhXEztBvKkfD9+Kq7Blx8EmRfGo6ziT+fZ0mE0WhZv87nFwvedApsCwTEt
   /r3VNNsRmwGGSXxTlbYj1OB3QdGeyl9Gk127akSRBBet7Y2XCezOu809cQIDAQAB
   AoGBALU3MORTfOAHa7LUe4mnZKKsEUHwcIIzWN8H9fEu9CNCK/LVgdfqUcL0L3W2
   WLA1C2L+d6vxzs8isVKLKBN+eOwUnhbMbMtD8h1SbTUV/JFrZsHycNcff4ythjLW
   dMo91+t7EcMKDVmej384Saj8D0z2i1QItvBK/msmSQqdYMXxAkEA72IanU3e5EI1
   rkII0/eVLliK6IM+uhaCgAz7Pt7bxntO2NZ8rscn93v6X7SS2Q/QQKyfsT+AbCXk
   bMCQE/AsFwJBAOe22JWgT1kIlmPVOaid/XErVV9YYdy7SxkAhvQYzHagWfhQaGpX
   sMrX1D5i4eIO9JHRu5zPupCGXRWT43UWr7cCQAi61Smja1t7pqWCNvwz7TbRd89e
   6eyzYXL2BjuWuQEWAhwaRlXBYY2+8bSHy0srLncNVI2MOUy4XQoyQ47WlWUCQGZM
   vZZhrmZ6ehsdWlVtWyWJoil0FdCkB+XD69D82dhNtysAJPk+Odl0LEpW0a9CNwvh
   8tiqhY2lJJeQMU3SdEUCQQCxJ5bXPM5iVDBzV50l3DfDN71srr9KGdCahCuxQpRt
   3ZRkZkz9izeRgRM5GRbOM7xpMWKLXFF0E7Y7jF3aa6xD
   -----END RSA PRIVATE KEY-----
   #+END_SRC

   Here is how we extract the certificate part of the OpenSSL command:
   #+BEGIN_SRC sh :var pk_and_cert=private_key_and_certificate :results code
   echo "$pk_and_cert" | sed -e 's/^[ ]*//' | tail -14
   #+END_SRC

   #+RESULTS:
   #+NAME: certificate_for_testing
   #+BEGIN_SRC sh
   -----BEGIN CERTIFICATE-----
   MIICITCCAYqgAwIBAgIJAPvk/teL+BzRMA0GCSqGSIb3DQEBBQUAMBYxFDASBgNV
   BAMTC2V4YW1wbGUuY29tMB4XDTE2MDIyMzAwNTg1M1oXDTE3MDIyMjAwNTg1M1ow
   FjEUMBIGA1UEAxMLZXhhbXBsZS5jb20wgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJ
   AoGBANisgEmNjzbaEv3Qpu8bP8V9utRsN8JxJxzUjNSf3k7Uj4BfAFfJpKHQcmFc
   TO0G8qR8P34qrsGXHwSZF8ajrOJP59nSYTRaFm/zucXC950CmwLBMS3+vdU02xGb
   AYZJfFOVtiPU4HdB0Z7KX0aTXbtqRJEEF63tjZcJ7M67zT1xAgMBAAGjdzB1MB0G
   A1UdDgQWBBSSEwsnoHW75GR+74R+9RJDHlMCJTBGBgNVHSMEPzA9gBSSEwsnoHW7
   5GR+74R+9RJDHlMCJaEapBgwFjEUMBIGA1UEAxMLZXhhbXBsZS5jb22CCQD75P7X
   i/gc0TAMBgNVHRMEBTADAQH/MA0GCSqGSIb3DQEBBQUAA4GBACJdQamPTI/qf6fo
   ovWrffMKnreULYrYAaL4drzQezUpoZ626/Ur3CwpIKqWDsYSvjwKPl0DUyLEuw5J
   2QD4X5n/K7/YGGQJSK8fxazsHavyxQhen1uz7X7zWFflIM6+5DvnOtoq3F0yQ84h
   L6U2LeRpzO4rWw3kxr/jsGkxYaUR
   -----END CERTIFICATE-----
   #+END_SRC

   (If you don't need to simulate a JWKs endpoint and you only want to
   validate and sign JWTs, below is how we generate an =RSA PRIVATE
   KEY= to sign JWTs)
   #+BEGIN_SRC sh :results code
     openssl genrsa 1024
   #+END_SRC

   No matter which OpenSSL command you use, this is how to extract the
   =RSA PUBLIC KEY=, which is used to validate JWTs signed with the
   private key.

   Essentially, you =cat= or =echo= the private key into
   =openssl=. However we use the =sed= command below to remove the
   leading whitespace that =org-babel= adds in front of the private key.
   #+BEGIN_SRC sh :var pk_and_cert=private_key_and_certificate :results code
   echo "$pk_and_cert" | sed -e 's/^[ ]*//' | head -15 | openssl rsa -pubout
   #+END_SRC

   #+RESULTS:
   #+NAME: public_key_for_testing
   #+BEGIN_SRC sh
   -----BEGIN PUBLIC KEY-----
   MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDYrIBJjY822hL90KbvGz/FfbrU
   bDfCcScc1IzUn95O1I+AXwBXyaSh0HJhXEztBvKkfD9+Kq7Blx8EmRfGo6ziT+fZ
   0mE0WhZv87nFwvedApsCwTEt/r3VNNsRmwGGSXxTlbYj1OB3QdGeyl9Gk127akSR
   BBet7Y2XCezOu809cQIDAQAB
   -----END PUBLIC KEY-----
   #+END_SRC


   The code for getting the =iat= ("Issued AT") time comes from the
   StackOverflow post: "[[http://stackoverflow.com/a/16755432/3191847][What is the easiest way to get current GMT time
   in Unix timestamp format?]]"

   #+NAME: create_jwt_for_testing
   #+BEGIN_SRC python
     def create_jwt(self, claims={}, kid='TESTKID'):
         d = datetime.utcnow()
         iat = int(calendar.timegm(d.utctimetuple()))
         exp = iat + 3600
         defaults = {
             "sub": "00u0abcdefGHIJKLMNOP",
             "ver": 1,
             "iss": "https://example.okta.com",
             "login": "username@example.com",
             "aud": self.okta['client_id'],
             "iat": iat,
             "exp": exp,
             "amr": [
                 "pwd"
             ],
             "idp": "00o0abcde1FGHIJKLMNO",
             "jti": "abcD0eFgHIJKLmnOPQ1r",
             "auth_time": iat
         }
         for key in claims.keys():
             defaults[key] = claims[key]
         headers = {}
         if kid:
             headers['kid'] = kid
         return jwt.encode(
             defaults,
             private_key,
             algorithm='RS256',
             headers=headers)
   #+END_SRC

   #+BEGIN_SRC python :tangle tests/test_flask_app.py :noweb yes :exports none :padline no
     from datetime import datetime
     import calendar
     import json

     from cryptography.hazmat.backends import default_backend
     from cryptography.hazmat.primitives import serialization
     from nose.tools import raises
     import jwt
     import responses
     import unittest

     import app as flask_app

     certificate = '''
     <<certificate_for_testing>>
     '''

     private_key = '''
     <<private_key_for_testing>>
     '''

     public_key = '''
     <<public_key_for_testing>>
     '''


     class TestFlaskApp(unittest.TestCase):

         def setUp(self):
             self.okta = {
                 'base_url': 'https://example.okta.com',
                 'api_token': '01A2bCd3efGh-ij-4K-Lmn5OPqrSTuvwXYZaBCD6EF',
                 'client_id': 'a0bcdEfGhIJkLmNOPQr1',
                 }
             flask_app.okta = self.okta
             flask_app.app.config['SECRET_KEY'] = "TESTING"
             self.app = flask_app.app.test_client()
             x5c_certificate = ''.join(certificate.split("\n")[2:-2])
             self.oauth2_v1_keys_response = {
                 'keys': [{
                     'kid': 'TESTKID',
                     'x5c': [x5c_certificate, 'FAKE', 'FAKE']
                     }]
                 }
             for domain in ['example.okta.com',
                            'example.oktapreview.com',
                            'invalid.example.com',
                            'invalid.okta.com']:
                 responses.add(
                     responses.GET,
                     'https://{}/.well-known/openid-configuration'.format(domain),
                     json.dumps({
                         'jwks_uri': 'https://{}/oauth2/v1/keys'.format(domain)
                     }),
                     status=200)
                 responses.add(
                     responses.GET,
                     'https://{}/oauth2/v1/keys'.format(domain),
                     json.dumps(self.oauth2_v1_keys_response),
                     status=200)

         def tearDown(self):
             pass

         <<create_jwt_for_testing>>

         <<test_has_default_route>>

         <<test_sso_via_id_token>>

         <<test_parse_jwt_valid>>

         <<test_parse_jwt_invalid_audience>>

         <<test_parse_jwt_invalid_issuer>>

         <<test_fetch_public_key_for_when_empty>>

         <<test_parse_jwt_invalid_kid>>

         <<test_parse_jwt_no_kid>>

         <<test_login_with_password>>
   #+END_SRC
